[
    {
      "Q": "How often has user experienced symptoms like fatigue or neck swelling, and have there been any noticeable patterns in when these symptoms worsen?"
    },
    {
      "Q": "What could be causing user’s recent fatigue despite improvements in other areas, and how has user’s diet and hydration been adjusted to address this?"
    },
    {
      "Q": "Why might user’s energy levels fluctuate, and what has user been doing differently on days when they feel more energetic?"
    },
    {
      "Q": "How has user’s emotional state been impacted by the recent changes in user’s symptoms, and are there any stressors that could be contributing to the fluctuations in user’s health?"
    },
    {
      "Q": "What recommendations has the AI assistant made regarding user’s sleep patterns, and has user noticed any connection between sleep quality and symptom severity?"
    },
    {
      "Q": "Could user’s dietary changes, such as incorporating more fruits and vegetables, be influencing user’s recent increase in energy, and should user consider further adjustments?"
    },
    {
      "Q": "What topics were discussed in user’s last conversation with the AI assistant, and did user receive any new insights or recommendations that have impacted user’s health routine?"
    },
    {
      "Q": "How frequently has user been tracking user’s symptoms, and has there been a trend in improvement or worsening over time?"
    },
    {
      "Q": "What factors might be contributing to user’s continued neck swelling, and how has user been monitoring it to provide accurate information to user’s healthcare provider?"
    },
    {
      "Q": "How effective have user’s efforts been in incorporating stress-reduction techniques, and has user noticed any changes in user’s physical or mental health as a result?"
    },
    {
      "Q": "Has user considered discussing potential supplements with user’s healthcare provider, and what impact could they have on managing user’s energy and immune health?"
    }
  ]
  